//=============================================================================
//
// テクスチャ管理処理 [textureManager.h]
// Author : JUN MARUYAMA
//
//=============================================================================
//*****************************************************************************
// インクルードガード
//*****************************************************************************
#ifndef _TEXTUREMANAGER_H_
#define _TEXTUREMANAGER_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "d3dx9.h"
#include <map>
#include <string>

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************
#pragma comment (lib,"d3d9.lib")
#pragma comment (lib,"d3dx9.lib")

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTextureManager
{
public:
	CTextureManager();
	~CTextureManager();

	HRESULT Init(void);
	void Uninit(void);

	LPDIRECT3DTEXTURE9 GetTexture(const char* pFileName);

private:
	void CreateAllTexture(void);
	void CreateTexture(const char* pFilePath);
	
	std::map<std::string, LPDIRECT3DTEXTURE9> m_mapTexture;
};

#endif